app/Modules/Orders/Models/Orders_m.php

SELECT *
FROM `orders`
WHERE `status` = 4
AND `created_by` = 14
ORDER BY `id` DESC
---
    function customer_orders($status) {
        $list = $this->db
                     ->table('orders')
                    //  ->where('status',$status)
                     ->where('created_by',auth()->user()->id)
                     ->orderBy('id','DESC')
                     ->get()
                     ->getResult();