app/Modules/Groups/Controllers/Administrator.php

SELECT *
FROM `groups`
---
            }
        }

        $data['groups'] = $model->findAll();