app/Modules/Specializations/Models/Specializations_m.php

INSERT INTO `specializations` (`name`, `description`, `created_at`) VALUES ('UI/UX', 'UI/UX', 1712574476)
---
    function insert_data($table, $data)
    {
        $sql = $this->db->table($table); // Replace 'your_table' with your actual table name
        $sql->insert($data);