app/Modules/Languages/Controllers/Administrator.php

SELECT *
FROM `languages`
---
            }
        }

        $data['languages'] = $model->findAll();