app/Models/GeneralModel.php

SELECT *
FROM `writers`
WHERE `user_id` = 17
---
    function user_profile() {
        $id = auth()->id();

        return $this->db->table('writers')->where('user_id', $id)->get()->getRow();

SELECT *
FROM `users`
ORDER BY `id` DESC
 LIMIT 1
---
    function last_users() {
        return $this->db
                    ->table('users')
                    ->orderBy('id', 'DESC')
                    ->limit(1)
                    ->get()
                    ->getRow();